<a href="https://colab.research.google.com/github/nadireus/Data-Analysis-with-Pandas/blob/main/Pandas_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
data = [1,3,5,7,9]
pd.DataFrame(data, columns = ["col1"])

   col1
0     1
1     3
2     5
3     7
4     9

In [3]:
data2n= np.arange(1,24,2).reshape(3,4)

In [5]:
pd.DataFrame(data2n, columns =["col1","col2","col3","col4"])

   col1  col2  col3  col4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [6]:
df = pd.DataFrame(data2n, columns=["col1","col2", "col3", "col4"], index=["a","b","c"])
df

   col1  col2  col3  col4
a     1     3     5     7
b     9    11    13    15
c    17    19    21    23

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.size

12

In [9]:
df.shape

(3, 4)

In [10]:
df.ndim

2

In [11]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [12]:
df.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [13]:
df.values

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [14]:
df.keys()

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [15]:
df.col1

a     1
b     9
c    17
Name: col1, dtype: int64

In [17]:
df["col1"]

a     1
b     9
c    17
Name: col1, dtype: int64

In [ ]:
creating  adata frame using dict

In [18]:
s1 = np.random.randint(2,10, size = 40)
s2 = np.random.randint(30,100, size = 40)
s3 = np.random.randint(100,150, size = 40)

In [19]:
myDict = {'var1': s1, 'var2': s2, 'var3':s3}

In [20]:
dfdict = pd.DataFrame(myDict)
dfdict

    var1  var2  var3
0      8    93   136
1      7    34   125
2      4    61   101
3      8    97   138
4      8    68   110
5      5    76   145
6      8    78   123
7      7    85   104
8      3    35   143
9      3    86   113
10     2    40   130
11     8    91   143
12     4    48   139
13     3    46   102
14     5    32   110
15     4    55   122
16     2    68   129
17     6    93   101
18     9    98   111
19     5    41   125
20     2    92   123
21     4    54   124
22     3    91   133
23     5    68   124
24     5    48   146
25     8    54   133
26     8    59   116
27     7    82   110
28     5    66   142
29     4    78   136
30     7    49   109
31     2    98   109
32     3    43   120
33     6    85   114
34     9    72   141
35     3    71   128
36     4    64   123
37     6    87   138
38     8    80   107
39     3    57   107

In [24]:
dfdict2 =dfdict[3:5]

In [25]:
dfdict2.index = ["a", "b"]

In [26]:
dfdict2.columns =["X","Y","Z" ]

In [ ]:
pd.DataFrame(dfdict2.values, index=["c","d","e"])

In [27]:
np.random.seed(101)
np.random.randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [28]:
df3 = pd.DataFrame(  np.random.randn(5,4),
                   index = ['A', 'B', 'C', 'D', 'E'],
                   columns = 'W X Y Z'.split())
df3

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [44]:
df3 = pd.DataFrame(  np.random.randn(5,4),
                   index = 'a b c d e'.split(),
                   columns = 'W X Y Z'.split())
df3

          W         X         Y         Z
a -1.467514 -0.494095 -0.162535  0.485809
b  0.392489  0.221491 -0.855196  1.541990
c  0.666319 -0.538235 -0.568581  1.407338
d  0.641806 -0.905100 -0.391157  1.028293
e -1.972605 -0.866885  0.720788 -1.223082

In [30]:
np.random.seed(101)
df3 = pd.DataFrame(  np.random.randn(5,4),
                   index = ['A', 'B', 'C', 'D', 'E'],
                   columns = 'W X Y Z'.split())
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df3["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [33]:
df3.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [34]:
df3[["W"]]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [35]:
df3[["W","Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [39]:
df3.loc[:,"W":"Y"]

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [40]:
df3.loc["B":"D","W":"Y"]

          W         X         Y
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237

In [45]:
df3["X"] + df3["Y"]

a   -0.656630
b   -0.633705
c   -1.106816
d   -1.296257
e   -0.146097
dtype: float64

In [47]:
df3["Result "] = df3["W"]*df3["X"]+df3["Y"]**2-df3["Z"]
df3

          W         X         Y         Z   Result
a -1.467514 -0.494095 -0.162535  0.485809  0.265701
b  0.392489  0.221491 -0.855196  1.541990 -0.723698
c  0.666319 -0.538235 -0.568581  1.407338 -1.442690
d  0.641806 -0.905100 -0.391157  1.028293 -1.456188
e -1.972605 -0.866885  0.720788 -1.223082  3.452639

In [52]:
df3["Result "] = df3["W"]*df3["X"]+df3["Y"].std()-df3["Z"].mean()
df3

          W         X         Y         Z   Result
a -1.467514 -0.494095 -0.162535  0.485809  0.059330
b  0.392489  0.221491 -0.855196  1.541990 -0.578829
d  0.641806 -0.905100 -0.391157  1.028293 -1.246660

In [54]:
df3.drop(["Y","Result "],axis =1, inplace=True)

In [51]:
df3.drop(["c","e"], axis = 0, inplace=True)

In [55]:
m=np.random.randint(1,40, size=(8,4))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3",'var4'])
df4

   var1  var2  var3  var4
0     2    26     3    17
1     3    25    16    30
2     7    29    23    21
3    26    34     8     9
4    17    30     1    17
5    39    36    26    32
6    12     9    12    13
7    16    23    38     3

In [56]:
df4.loc[2]

var1     7
var2    29
var3    23
var4    21
Name: 2, dtype: int64

In [57]:
df4.loc[2:6]

   var1  var2  var3  var4
2     7    29    23    21
3    26    34     8     9
4    17    30     1    17
5    39    36    26    32
6    12     9    12    13

In [58]:
df4.index ='a b c d e f g h'.split()

In [59]:
df4.loc["c"]

var1     7
var2    29
var3    23
var4    21
Name: c, dtype: int64

In [60]:
df4.loc["c":"f"]

   var1  var2  var3  var4
c     7    29    23    21
d    26    34     8     9
e    17    30     1    17
f    39    36    26    32

In [61]:
df4.loc["c":"f", "var1":"var3"]

   var1  var2  var3
c     7    29    23
d    26    34     8
e    17    30     1
f    39    36    26

In [62]:
df4.loc["c":"f"] [["var1","var2","var3"]]

   var1  var2  var3
c     7    29    23
d    26    34     8
e    17    30     1
f    39    36    26

In [63]:
df4.iloc[1:4,2:4]

   var3  var4
b    16    30
c    23    21
d     8     9

In [64]:
df4.iloc[1:4][2:4]

   var1  var2  var3  var4
d    26    34     8     9

In [65]:
df3.iloc[:,2:]

          Z
a  0.485809
b  1.541990
d  1.028293

In [67]:
df3[df3["X"]>0]

          W         X        Z
b  0.392489  0.221491  1.54199

In [69]:
df3

          W         X         Z
a -1.467514 -0.494095  0.485809
b  0.392489  0.221491  1.541990
d  0.641806 -0.905100  1.028293

In [70]:
df3[(df3["X"]>0) & (df3["Z"]>0)]

          W         X        Z
b  0.392489  0.221491  1.54199

In [71]:
df3[df3.Z>0][["W"]]

          W
a -1.467514
b  0.392489
d  0.641806